--- a/Part3-Principle/ch07_principle.md
+++ b/Part3-Principle/ch07_principle.md
@@ -375,33 +369,32 @@ public class Part {
 
 <!-- ![](https://i.imgur.com/db1bF3L.png)
  -->
-```plantuml
-@startuml
-class Part {
-    - partName: String
-    ---
-    +setPrice(double)
-    +getPrice(): double
-    +setPricePolicy(PricePolicy)
-}
+```mermaid
+classDiagram
+    class Part {
+        -partName: String
+        +setPrice(double)
+        +getPrice() double
+        +setPricePolicy(PricePolicy)
+    }
 
-abstract class PricePolicy {
-    - basePrice: double
-    ---
-    +setPrice(double)
-    +getPrice(): double    
-}
+    class PricePolicy {
+        <<abstract>>
+        -basePrice: double
+        +setPrice(double)
+        +getPrice() double
+    }
 
-class SalePrice {
-    +setDiscount()
-    +getPrice() {override}
-}
+    class SalePrice {
+        +setDiscount()
+        +getPrice()
+    }
 
+    class ChrismaxPolicy
 
-Part o-> PricePolicy
-PricePolicy <|--SalePrice
-PricePolicy <|--ChrismaxPolicy
-@enduml
+    Part o-- PricePolicy
+    PricePolicy <|-- SalePrice
+    PricePolicy <|-- ChrismaxPolicy
 ```
 
 
